---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarCurvesData
source: html/839a4d4b-90c0-5007-5be9-d9859299cfc5.htm
---
# RebarCurvesData Properties

Specifies whether the .NET object represents a valid Revit entity.